user/tutorials/Nike/sprayA/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2e-05;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 2e-05;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 2e-05;
    }
}


// ************************************************************************* //
