user/tutorials/Nike/sprayA/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            ISATVLEheRhoThermo;//hePsiThermo;//VLEhePsiThermo;//HYhePsiThermo;
    mixture         nLreactingMixture;//reactingMixture;//HYreactingMixture;//HYreactingMixture;
    transport       chung;//sutherland;
    thermo          janaf;
    energy          sensibleInternalEnergy;//sensibleEnthalpy;//sensibleInteralEnergy;//
    equationOfState PengRobinson;//perfectGas;//PengRobinson;//perfectGas;
    specie          specie;
}

ISATDictFile "$FOAM_CASE/constant/ISATDict";
/*
mixture
{
    equationOfState
    {
        ivle    0;
    }
}
*/
dpdt yes;
chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/chem";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.new";

CHEMKINFile     "$FOAM_CASE/chemkin/chem.inp";
CHEMKINThermoFile "$FOAM_CASE/chemkin/therm.dat";
CHEMKINTransportFile "$FOAM_CASE/chemkin/transportProperties";

tableName "ThermoTable_O2.txt";//"ThermoTable.txt"; 
newFormat       yes;

inertSpecie     N2;
noVLE false;
inputK false;
Kinit (0.0256056208368 3.19624756212);

liquids
{
    H2O;
}

solids
{}
BinaryInteractionParameter
{
    specielist (N2       C12H26  CO2     CH4     H2O     O2      C7H16   H2      H2S);
    
    matrix     (0.0      0.19    -0.0192 0.5     0.1738  -0.0129 0.12    0.103   0.000    //N2
                0.19     0.0     0.000   0.000   0.000   0.000   0.000   0.000   0.000    //C12H26
                -0.011   0.000   0.0     0.103   0.137   0.115   0.000   0.000   0.000    //CO2        
                0.5      0.000   0.103   0.0     0.0312  0.0305  0.000   0.000   0.08     //CH4        
                0.0      0.000   0.137   0.17    0.0     0.0     0.000   0.000   0.000    //H2O
                -0.00978 0.000   0.1188  0.0305  0.0     0.0     0.000   0.000   0.000    //O2          
                0.12     0.000   0.000   0.000   0.000   0.000   0.000   0.000   0.000    //C7H16                
                0.103    0.000   0.000   0.000   0.000   0.000   0.000   0.000   0.000    //H2
                0.000    0.000   0.000   0.08    0.000   0.000   0.000   0.000   0.000);  //H2S
} 


// ************************************************************************* //
