user/tutorials/Nike/sprayA/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs            ("libISATVLERhoThermo.so");
application     PRpuresprayFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5e-5;//0.002;

deltaT          2.0e-11;

writeControl    adjustableRunTime;//timeStep;//adjustableRunTime;

writeInterval   1.e-7;//1;//1e-7;//1.e-7;

purgeWrite      0;

writeFormat     ascii;//binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.1;//0.04

runTimeModifiable yes;
/*
functions
{

    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl   outputTime;
        fields
        (
              U
              {
                mean        on;
                prime2Mean  on;
                base        time;
              }
              CO2
              {
                mean        on;
                prime2Mean  on;
                base        time;
              }
              O2
              {
                mean        on;
                prime2Mean  on;
                base        time;
              }
              T
              {
                mean        on;
                prime2Mean  on;
                base        time;
              }
              vaporfrac
              {
                mean        on;
                prime2Mean  on;
                base        time;
              }
              p
              {
                mean        on;
                prime2Mean  on;
                base        time;
              }
              rho
              {
                mean        on;
                prime2Mean  on;
                base        time;
              }

        );
    }
}
*/
/*
functions
{
    #includeFunc internalProbes
}*/


// ************************************************************************* //
